{
    "conv_1762477356846_l5afpobkyn7": [
        {
            "timestamp": "2025-11-07 02:02:41",
            "type": "user",
            "message": "hola",
            "response": "¡Hola! ¿Cómo estás hoy? 😊 Me da mucho gusto saludarte. ¿En qué puedo ayudarte hoy con respecto al Hotel INDET o el Instituto de Deportes del Estado Trujillo? ¿Quizás quieres saber algo sobre nuestras instalaciones deportivas, las habitaciones del hotel, o alguna otra cosa? ¡Estoy a tu disposición!"
        },
        {
            "timestamp": "2025-11-07 02:02:56",
            "type": "user",
            "message": "qu ehabitaciones hay disponibles?",
            "response": "¡Hola! ¿Cómo estás hoy? 😊\n\nCon gusto te ayudo con la disponibilidad de habitaciones en el Hotel INDET. Tenemos habitaciones individuales, dobles y suites familiares, todas diseñadas pensando en el confort y la recuperación de los atletas. \n\nPara darte información precisa sobre la disponibilidad, necesitaría saber:\n\n*   ¿Qué fechas tienes en mente para tu estadía? (Fecha de llegada y salida)\n*   ¿Cuántas personas se hospedarían? (Adultos, niños, personas con discapacidad)\n*   ¿Tienes alguna preferencia de piso? (La planta baja es ideal para personas con discapacidad)\n\nCon esta información, puedo verificar la disponibilidad y ofrecerte las mejores opciones. ¡Espero tu respuesta! 😉"
        },
        {
            "timestamp": "2025-11-07 02:03:49",
            "type": "user",
            "message": "pienso llegar el 7 de noviembre e irme el 9 de noviembre somos 3 personas",
            "response": "¡Saludos! Estoy para servirte en todo lo relacionado con el Hotel INDET. ¿Tienes alguna pregunta sobre nuestras instalaciones deportivas o reservas?"
        }
    ],
    "conv_1762477622404_xtbn7ismw8p": [
        {
            "timestamp": "2025-11-07 02:07:15",
            "type": "user",
            "message": "quiero reservar que habitaciones estan disponibles",
            "response": "¡Hola! Claro, con gusto te ayudo con tu reserva. Para verificar la disponibilidad de habitaciones, necesito un poco más de información. ¿Tienes en mente alguna fecha específica para tu llegada y salida? También, ¿cuántas personas serían (adultos, niños, o personas con alguna discapacidad)?\n\nCon esa información, puedo revisar qué opciones tenemos disponibles y recomendarte las habitaciones que mejor se adapten a tus necesidades. ¡Estoy aquí para ayudarte a que tu estadía en el Hotel Deportivo INDET sea perfecta! 😊"
        },
        {
            "timestamp": "2025-11-07 02:09:48",
            "type": "user",
            "message": "pienso llegar el 7 de noviembre e irme el 9 de noviembre somos 3 personas",
            "response": "¡Hola! Qué gusto verte por aquí. Soy el asistente del Hotel INDET y puedo ayudarte con información sobre habitaciones, reservas y servicios deportivos."
        }
    ],
    "8828efc9796468938c51e116bc62a7ac": [
        {
            "timestamp": "2025-11-07 02:13:45",
            "type": "user",
            "message": "quiero reservar que habitaciones estan disponibles",
            "response": "¡Hola! Claro que sí, con gusto te ayudo con tu reserva. Para poder darte la información más precisa sobre las habitaciones disponibles, necesito saber un poco más:\n\n*   ¿En qué fechas te gustaría hospedarte? (Fecha de llegada y salida)\n*   ¿Cuántas personas serían? (Adultos, niños y si alguno necesita acceso para discapacitados)\n*   ¿Tienes alguna preferencia por el piso? (Recuerda que la planta baja es ideal para personas con discapacidades).\n\nUna vez que me des estos detalles, puedo verificar la disponibilidad y mostrarte las opciones que mejor se adapten a tus necesidades. ¡Estoy aquí para ayudarte en lo que necesites!"
        },
        {
            "timestamp": "2025-11-07 02:13:52",
            "type": "user",
            "message": "pienso llegar el 7 de noviembre e irme el 9 de noviembre somos 3 personas",
            "response": "¡Hola! ¿Cómo estás? Soy el asistente virtual del Hotel INDET. Puedo ayudarte con información sobre reservas, habitaciones, servicios e instalaciones deportivas."
        },
        {
            "timestamp": "2025-11-07 02:20:44",
            "type": "user",
            "message": "si guiame",
            "response": "¡Claro! Recuerdo que estamos hablando de tu reserva para las fechas del 7 de noviembre al 9 de noviembre para 3 personas.\n\n🏨 **Guía para Hacer tu Reserva**\n\nSigue estos pasos:\n\n1️⃣ **Ve a la página de Reservaciones**\n   • Desde el menú principal o haz clic en 'Reservar'\n\n2️⃣ **Selecciona las fechas**\n   • Ya tienes las fechas: 7 de noviembre - 9 de noviembre\n\n3️⃣ **Elige el piso**\n   • Planta Baja (accesible para discapacitados)\n   • Pisos superiores (habitaciones estándar)\n\n4️⃣ **Indica el número de personas**\n   • Ya mencionaste: 3 personas\n\n5️⃣ **Selecciona habitaciones disponibles**\n   • El sistema te mostrará las opciones\n   • Elige las que necesites\n\n6️⃣ **Confirma y reserva**\n   • Revisa todos los detalles\n   • Haz clic en 'Reservar'\n\n💡 **Información importante:**\n• Check-in: A partir de las 15:00\n• Check-out: Hasta las 12:00\n• Cancelación gratuita hasta 24h antes\n\n¿Te ayudo con algún paso específico o tienes alguna pregunta?"
        }
    ],
    "conv_1762478247945_rq98x2kylzs": [
        {
            "timestamp": "2025-11-07 02:17:37",
            "type": "user",
            "message": "quiero reservar",
            "response": "¡Claro! ¡Hola! ¿Cómo estás hoy? 😊\n\n¡Genial que quieras reservar! Para ayudarte con la reserva, necesito algunos detalles. ¿Tienes en mente las fechas de llegada y salida? También, ¿para cuántas personas sería la reserva (adultos, niños, personas con discapacidad)? Y si tienes alguna preferencia de piso (quizás por accesibilidad), ¡dímelo!\n\nCon esa información, puedo verificar la disponibilidad de habitaciones y ayudarte a completar el proceso. ¡Estoy aquí para lo que necesites! 😉"
        },
        {
            "timestamp": "2025-11-07 02:18:17",
            "type": "user",
            "message": "somos 3 personas, quiero llegar el 3 de diciembre y salir el 6 de diciembre que habitaciones hay disponibles?",
            "response": "¡Perfecto! Basándome en lo que me has contado anteriormente, te ayudo con la disponibilidad de habitaciones.\n\n🏨 **Información de Habitaciones Disponibles**\n\n📊 **Total de habitaciones:** 36\n\n🏠 **Tipos de habitaciones:**\n• Habitación 3 literas: 12\n• Habitación 7 literas: 12\n• Habitación 8 literas: 12\n\n💡 **Para verificar disponibilidad específica:**\n• Ve a la página de Reservaciones\n• Selecciona las fechas que mencionaste\n• Elige el número de personas\n• El sistema mostrará habitaciones disponibles automáticamente\n\n¿Te gustaría que te guíe para hacer la reserva ahora?"
        },
        {
            "timestamp": "2025-11-07 02:18:48",
            "type": "user",
            "message": "si guiame",
            "response": "¡Hola! Soy el asistente del Hotel INDET. ¿En qué puedo ayudarte hoy? Puedo informarte sobre habitaciones, reservas, servicios e instalaciones deportivas."
        }
    ],
    "conv_1762478545383_fjek60rauf": [
        {
            "timestamp": "2025-11-07 02:22:29",
            "type": "user",
            "message": "hola",
            "response": "¡Hola! ¿Cómo estás hoy? 😊 Me da mucho gusto saludarte. ¿En qué puedo ayudarte hoy con respecto al Hotel INDET o el Instituto de Deportes del Estado Trujillo? ¿Quizás quieres saber algo sobre nuestras instalaciones deportivas, las habitaciones del hotel, o alguna otra cosa? ¡Estoy a tu disposición!"
        },
        {
            "timestamp": "2025-11-07 02:22:46",
            "type": "user",
            "message": "quiero saber que habitas hay para reservar",
            "response": "¡Hola! ¿Cómo estás hoy? 😊\n\nClaro, con gusto te ayudo a ver qué habitaciones tenemos disponibles para reservar. Para poder darte información precisa, ¿podrías decirme las fechas en las que te gustaría hospedarte y cuántas personas serían (adultos, niños, y si hay personas con discapacidad)? También, ¿tienes alguna preferencia de piso, como por ejemplo, si necesitas acceso para personas con discapacidad?\n\nCon esa información, puedo revisar la disponibilidad y mostrarte las opciones que tenemos. ¡Espero tu respuesta! 😊"
        },
        {
            "timestamp": "2025-11-07 02:23:54",
            "type": "user",
            "message": "somos 4 personas, querempos reservar desde el 12 de noviembre hasta el 24",
            "response": "¡Claro! Recuerdo que estamos hablando de tu reserva.\n\n🏨 **Guía para Hacer tu Reserva**\n\nSigue estos pasos:\n\n1️⃣ **Ve a la página de Reservaciones**\n   • Desde el menú principal o haz clic en 'Reservar'\n\n2️⃣ **Selecciona las fechas**\n   • Fecha de llegada (check-in)\n   • Fecha de salida (check-out)\n\n3️⃣ **Elige el piso**\n   • Planta Baja (accesible para discapacitados)\n   • Pisos superiores (habitaciones estándar)\n\n4️⃣ **Indica el número de personas**\n   • Adultos, niños, personas con discapacidad\n\n5️⃣ **Selecciona habitaciones disponibles**\n   • El sistema te mostrará las opciones\n   • Elige las que necesites\n\n6️⃣ **Confirma y reserva**\n   • Revisa todos los detalles\n   • Haz clic en 'Reservar'\n\n💡 **Información importante:**\n• Check-in: A partir de las 15:00\n• Check-out: Hasta las 12:00\n• Cancelación gratuita hasta 24h antes\n\n¿Te ayudo con algún paso específico o tienes alguna pregunta?"
        },
        {
            "timestamp": "2025-11-07 02:24:22",
            "type": "user",
            "message": "dime que habitaciones hay disponibles para esas fechas que te pase",
            "response": "¡Perfecto! Basándome en lo que me has contado anteriormente sobre las fechas del 12 de noviembre para 4 personas, te ayudo con la disponibilidad de habitaciones.\n\n🏨 **Información de Habitaciones Disponibles**\n\n📊 **Total de habitaciones:** 36\n\n🏠 **Tipos de habitaciones:**\n• Habitación 3 literas: 12\n• Habitación 7 literas: 12\n• Habitación 8 literas: 12\n\n💡 **Para verificar disponibilidad específica:**\n• Ve a la página de Reservaciones\n• Selecciona las fechas que mencionaste\n• Elige el número de personas\n• El sistema mostrará habitaciones disponibles automáticamente\n\n¿Te gustaría que te guíe para hacer la reserva ahora?"
        },
        {
            "timestamp": "2025-11-07 02:24:48",
            "type": "user",
            "message": "que mas puedes hacer?",
            "response": "¡Hola! 😊 ¡Qué bueno que sigues por aquí!\n\nAdemás de ayudarte a encontrar la habitación perfecta para ti y tus 3 acompañantes desde el 12 al 24 de noviembre, puedo contarte sobre los servicios que ofrece el Hotel INDET, como el restaurante, la piscina, el gimnasio y el Wi-Fi gratuito. \n\nTambién puedo darte información sobre las instalaciones deportivas del Instituto de Deportes del Estado Trujillo, como las canchas de baloncesto, voleibol, el campo de fútbol y la pista de atletismo. ¡Quizás les interese usar alguna durante su estadía!\n\n¿Hay algo más específico en lo que te pueda ayudar? ¿Quieres saber algo sobre los precios de las habitaciones, o tal vez sobre las actividades deportivas que se realizan en el Instituto? ¡Dime y con gusto te ayudo! 😉"
        }
    ]
}